// binary_search(first, last, key) 二分探索
    // first から last の範囲で key と等しい要素を探す
    // 見つかればtrue, そうでなければfalseを返す
    // 二分探索を行うためには、ソートされた範囲である必要がある

// lower_bound(first, last, key)
    // first から last の範囲で key 「以上の」最初の要素を探す
    // その要素への「「最小のインデックス」のイテレータを返す
    // その要素が存在しない場合は last を返す
    // 二分探索を行うためには、ソートされた範囲である必要がある

// upper_bound(first, last, key)
    // first から last の範囲で key 「より大きい」最初の要素を探す
    // その要素への「最小のインデックス」のイテレータを返す
    // その要素が存在しない場合は last を返す
    // 二分探索を行うためには、ソートされた範囲である必要がある